<template>
  <q-page class="page">
    <h4>
      <p>
        <strong>Интеллектуальный анализ текстов (Текстовая аналитика)</strong>
      </p>
    </h4>
    <p>
      <strong>Интеллектуальный анализ текстов (Текстовая аналитика)</strong>
      (<em>ИАТ</em>, англ. <span lang="ru">text mining</span>) &mdash;
      направление в искусственном интеллекте, целью которого является получение
      информации из коллекций текстовых документов, основываясь на применении
      эффективных в практическом плане методов машинного обучения и обработки
      естественного языка. Название &laquo;интеллектуальный анализ
      текстов&raquo; перекликается с понятием
      <em>&laquo;интеллектуальный анализ данных&raquo;</em> (<em>ИАД</em>, англ.
      <span lang="ru">data mining</span>), что выражает схожесть их целей,
      подходов к переработке информации и сфер применения; разница проявляется
      лишь в конечных методах, а также в том, что ИАД имеет дело с хранилищами и
      базами данных, а не электронными библиотеками и корпусами текстов.
    </p>
    <h4>Наши проекты</h4>
    <ul>
      <li>
        <a href="#"
          >Разработка программного средства обнаружения активных эксплоитов в
          корпоративном комьюнити</a
        >
      </li>
      <li>
        <a href="#"
          >Разработка программного средства анализа текстов для распознавания
          именованных сущностей</a
        >
      </li>
      <li>
        <a href="#"
          >Разработка информационной системы анализа диалоговых текстов на
          основе тематического моделирования</a
        >
      </li>
      <li>
        <a href="#"
          >Разработка программного средства классификации текстов с учетом
          векторной модели</a
        >
      </li>
      <li>
        <a href="#/sa"
          >Разработка системы анализа сетевой активности для обнаружения
          вторжений</a
        >
      </li>
    </ul>
    <h4>Сообщество&nbsp;</h4>
    <p>
      <a
        href="https://vk.com/text_mining"
        target="_blank"
        title="Сообщество ВКонтакте Текстовая аналитика"
        >Сообщество ВКонтакте Текстовая аналитика</a
      >
    </p>
    <h4>Группы задач&nbsp;</h4>
    <p>
      Ключевыми группами задач ИАТ являются: категоризация текстов, извлечение
      информации и информационный поиск, обработка изменений в коллекциях
      текстов, а также разработка средств представления информации для
      пользователя.
    </p>
    <p>
      <em>Категоризация документов</em> заключается в отнесении документов из
      коллекции к одной или нескольким группам (классам, кластерам) схожих между
      собой текстов (например, по теме или стилю).&nbsp;Категоризация может
      происходить при участии человека, так и без него.&nbsp;В первом случае,
      называемом&nbsp;<em>классификацией документов</em>, система ИАТ должна
      отнести тексты к уже определённым (удобным для него) классам.&nbsp;В
      терминах машинного обучения для этого необходимо произвести&nbsp;<em
        >обучение с учителем</em
      >, для чего пользователь должен предоставить системе ИАТ как множество
      классов, так и образцы документов, принадлежащих этим классам.
    </p>
    <p>
      Второй случай категоризации называется&nbsp;<em
        >кластеризацией документов</em
      >.&nbsp;При этом система ИАТ должна сама определить множество кластеров,
      по которым могут быть распределены тексты, &mdash; в машинном обучении
      соответствующая задача называется&nbsp;<em>обучением без учителя</em>. В
      этом случае пользователь должен сообщить системе ИАТ количество кластеров,
      на которое ему хотелось бы разбить обрабатываемую коллекцию
      (подразумевается, что в алгоритм программы уже заложена процедура выбора
      признаков).
    </p>
    <h4>Применение</h4>
    <p>
      В последнее время анализ текста привлекает всё больше внимания в различных
      областях, таких как безопасность, коммерция, наука.
    </p>
    <h5>В безопасности</h5>
    <p>
      Многие пакеты анализа текста, такие как Aerotext и Attensity, нацелены на
      рынок приложений безопасности, в частности на анализ источников простого
      текста, например новостных сайтов.
    </p>
    <h5>В программном обеспечении</h5>
    <p>
      Исследования и разработки подразделений крупных компаний, таких как IBM,
      Apple и Microsoft, исследуют технологии анализа текста с целью будущей
      автоматизации процессов анализа и извлечения данных.
    </p>
  </q-page>
</template>

<script>
import { defineComponent } from "vue";

export default defineComponent({
  name: "IndexPage",
});
</script>
<style lang="sass">
.page
  padding-bottom: 10px
  padding-top: 10px
  padding-left: 10px
  padding-r: 10px
</style>
